rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
                printf("Data Transfer finished\n");

            }
        }

//        SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
        
        free(test_buffer);
}


int SendDataBySPI2Slave(UInt16Value *data, int data_length_in_bytes)
{
    int i = 0;
    int word_len = data_length_in_bytes >> 1;
    
    int val;

    printf("Sending %d bytes of data\n", data_length_in_bytes);

    for(i = 0; i < word_len; i++)
    {
        val = SpiChnGetC(SPI_CHANNEL2);
        SpiChnPutC(SPI_CHANNEL2, data[i].v.upper);
        int tmp = SPI2BUF;
        
        if(val == 0xFF)
            break;
        
        val = SpiChnGetC(SPI_CHANNEL2);
        SpiChnPutC(SPI_CHANNEL2, data[i].v.lower);
        tmp = SPI2BUF;
        
        if(val == 0xFF)
            break;
    }

    printf("***  %d bytes SENT  ***\n", i*2);
    
    SPI2CONbits.ON = 0;
    WaitMS(1);
    SPI2CONbits.ON = 1;
    
    return i*2;
}



void TestUART2()
{
    int count = 0;
    int tx = 50;

    printf("Reading UART2...\n");
    
    while(1)
    {
        if(U2STAbits.URXDA)
        {
            int val = (int) UARTGetDataByte(1); // UART2
            
            printf("%d:   UART2 read value %d\n", count++, val);

            printf("%d:   Writing to UART2 %d\n", (int) tx);
            
            WRITE_TO_UART2(tx);
            
            tx += 15;
            tx %= 256;
        }
    }
}



void TestSPi2Slave()
{
    
    
        SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
        SpiChnEnable(SPI_CHANNEL2, 1);
        
        SPI2CONbits.ON = 1;
    
        int i = 0;
        int tmp = 0;
        int data_length = 100;
   
        
        while(1)
        {
//            SPI2CONbits.ON = 1;
            printf("Waiting to send %d bytes of data\n", data_length);
            for(i = 0; i < data_length/2; i++)
            {
                int val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, i+1);
                tmp = SPI2BUF;
                
                if(val == 0xFF)
                {
                    printf("val == %d, Exiting SPI2 read loop\n", val);
                    break;
                }
                
                int v = 0; while(v++ < 10);
                
                val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, i+1+10);
                tmp = SPI2BUF;
                
                if(val  == 0xFF)
                {
                    printf("2nd level val == %d, Exiting SPI2 read loop\n", val);
                    break;
                }

                
//                printf(" i = %d\n", i);
            }
            
//            printf("%i == d\n", i);
            
            printf("Data transfered\n");
            SPI2CONbits.ON = 0;
            WaitMS(1);
            SPI2CONbits.ON = 1;
        }

        SpiChnClose(SPI_CHANNEL2);
}



void TestSPi2Slave_WithSendData()
{
        int             buffer_length = 15000;
        UInt16Value     buffer[buffer_length/2];
    
    
        SpiChnEnable(SPI_CHANNEL2, 0);
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnEnable(SPI_CHANNEL2, 1);
        
        SPI2CONbits.ON = 1;
        
        int k =0;
        for(k = 0; k < buffer_length/2; k++)
        {
            int v = k % 90;
            buffer[k].v.upper = v+1;
            buffer[k].v.lower = v+1+10;
        }
        
   
        
        while(1)
        {
//            SPI2CONbits.ON = 1;
            printf("Waiting to send %d bytes of data\n", buffer_length);

            int tx_len = SendDataBySPI2Slave(buffer, buffer_length);
//            printf("%i == d\n", i);
            
            printf("Data transfered %d bytes\n", tx_len);
        }

        SpiChnClose(SPI_CHANNEL2);
}